app/Controllers/Dashboard.php

    public function admin()
    {
        if(session()->get('role') != 'admin') return redirect()->to('/auth');

        $bookModel = new BookModel();
        $transModel = new TransactionModel();
        $memberModel = new MemberModel();

        $data = [
            'total_books' => $bookModel->countAll(),
            'borrowed_books' => $transModel->where('status', 'borrowed')->countAllResults(),
            'total_members' => $memberModel->countAll(),
            'overdue_count' => $transModel->where('status', 'overdue')->countAllResults()
---
SELECT COUNT(*) AS `numrows`
FROM `transactions`
WHERE `status` = 'borrowed'
SELECT COUNT(*) AS `numrows` FROM `members`
SELECT COUNT(*) AS `numrows`
FROM `transactions`
WHERE `status` = 'overdue'