app/Controllers/ProfileController.php

SELECT *
FROM `users`
WHERE `users`.`id` = '1'
---
public function index()
{
    // Check if user is logged in
    if (!session()->get('isLoggedIn')) {
        return redirect()->to('/auth');
    }

    $userId = session()->get('id');
    $role = session()->get('role');

    $data = [
        'title' => 'My Profile',
        'user' => $this->userModel->find($userId),

UPDATE `users` SET `username` = 'admin', `email` = 'admin@gmail.com', `updated_at` = '2026-08-07 09:58:42'
WHERE `users`.`id` IN ('1')
---
                'email' => $this->request->getPost('email'),
            ];

            $this->userModel->update($userId, $userData);